### DataFrame 행/열 인덱스 변경
- 방법 1 : 속성명으로 변경 --> 전체 변경 >>> index/columns
- 방법 2 : 메서드로 변경 --> 일부 변경 >>> rename()

In [28]:
# 모듈 로딩
import pandas as pd

In [29]:
#데이터 준비
data={'name': ['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100, 200,300],
      'height':[180,300,200]}

In [30]:
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [31]:
# [실습] 열 인덱스을 이름, 직업, 성별, 나이, 키로 변경
# 형식 : 변수명.index/columns=[각 인덱스 갯수에 맞게 입력]
dataDF.columns=['이름', '직업', '성별', '나이', '키']
dataDF

     이름  직업 성별   나이    키
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [32]:
# 일부 변경 : 키 ----> 신장 으로 변경 >>> 데이터 원본은 건들지 않는다.
# 형식 : 변수명.rename(index/columns={before:after})
dataDF.rename(columns={'키' : '신장'})

     이름  직업 성별   나이   신장
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [33]:
dataDF # >>> rename으로 데이터 원본 바뀌지 X

     이름  직업 성별   나이    키
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [34]:
dataDF.rename(columns={'키' : '신장'}, inplace=True ) 
# but 매개변수로 inplace=True 식을 쓰면

In [35]:
dataDF # inplace=True을 하면 원본 변경, 기본값은 False

     이름  직업 성별   나이   신장
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [36]:
data2= dataDF.rename(columns={'키' : '신장'}, inplace=True )
print(data2) # rename >>> None 출력

None

In [37]:
#[실습] 행 인덱스 0,1,2 ===> p0, p1, p2로 변경 (속성값으로 변경)
dataDF.index=['P0','P1','P2']
dataDF

      이름  직업 성별   나이   신장
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [38]:
##[실습] 행 인덱스 P2 ==> END로 변경 (메서드로 변경)
dataDF.rename(index={'P2' : 'END'})

       이름  직업 성별   나이   신장
P0    홍길동  의적  남  100  180
P1    마징가  로봇  남  200  300
END  원더우먼  영웅  여  300  200

In [39]:
dataDF # 자료변경은 안됨

      이름  직업 성별   나이   신장
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [40]:
dataDF.rename(index={'P2' : 'END'}, inplace=True) # inplace=True로 원본 변경
dataDF

       이름  직업 성별   나이   신장
P0    홍길동  의적  남  100  180
P1    마징가  로봇  남  200  300
END  원더우먼  영웅  여  300  200